static drift/KVLCC2/Fr0.1424_alpha6.00/system/forces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/


forces
{
	type forces;
	libs ( "libforces.so" );
	rho rho;
	log yes;
	writeControl timeStep;
	writeInterval 1;
	patches ( hull deck );
	rhoInf 999.1;
	CofR (0.0 0.0 0.0);
}

forceCoeffs
{
	type forceCoeffs;
	libs ( "libforces.so" );
	log yes;
	writeControl timeStep;
	writeInterval 1;
	rho rho;
	patches ( hull deck );
	rhoInf 999.1;
	CofR (0.0 0.0 0.0);
	liftDir (0 1 0);
	dragDir (1 0 0);
	pitchAxis (0 0 1);
	magUInf 0.9943120150294875;
	lRef 4.97;
	Aref 1.6055585;
}